In [12]:
import sqlite3

# Conección a la base de datos

In [13]:
conn = sqlite3.connect('database/aluar.db')

# Creación de una tabla (CREATE TABLE)

In [14]:
conn.execute('''CREATE TABLE COMPANY
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50),
         SALARY         REAL);''')

In [15]:
schema = conn.execute("""PRAGMA table_info(COMPANY);""")

In [16]:
for s in schema:
    print(s)

(0, 'ID', 'INT', 1, None, 1)
(1, 'NAME', 'TEXT', 1, None, 0)
(2, 'AGE', 'INT', 1, None, 0)
(3, 'ADDRESS', 'CHAR(50)', 0, None, 0)
(4, 'SALARY', 'REAL', 0, None, 0)

# Agregamos datos (INSERT)

In [17]:
N = 5
conn.execute(f"INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES ({N}, 'Paul', 32, 'California', 20000.00 )");

conn.execute(f"INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES ({N+1}, 'Allen', 25, 'Texas', 15000.00 )");

conn.execute(f"INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES ({N+2}, 'Teddy', 23, 'Norway', 20000.00 )");

conn.execute(f"INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES ({N+3}, 'Mark', 25, 'Rich-Mond ', 65000.00 )");

# Seleccionamos datos (SELECT)

In [18]:
cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
   print("ID = ", row[0])
   print("NAME = ", row[1])
   print("ADDRESS = ", row[2])
   print("SALARY = ", row[3], "\n")

ID =  5
NAME =  Paul
ADDRESS =  California
SALARY =  20000.0

ID =  6
NAME =  Allen
ADDRESS =  Texas
SALARY =  15000.0

ID =  7
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0

ID =  8
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0

# UPDATE

In [19]:
conn.execute("""UPDATE COMPANY set SALARY = 2000.00 where NAME = 'Allen'""")
conn.commit()
print("Total number of rows updated :", conn.total_changes)
# conn.close()
cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
   print("ID = ", row[0])
   print("NAME = ", row[1])
   print("ADDRESS = ", row[2])
   print("SALARY = ", row[3], "\n")

Total number of rows updated : 5
ID =  5
NAME =  Paul
ADDRESS =  California
SALARY =  20000.0

ID =  6
NAME =  Allen
ADDRESS =  Texas
SALARY =  2000.0

ID =  7
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0

ID =  8
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0

# DELETE

In [20]:
conn.execute("DELETE from COMPANY where ID = 2;")
conn.commit()

print("Total number of rows updated :", conn.total_changes)
# conn.close()
cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
   print("ID = ", row[0])
   print("NAME = ", row[1])
   print("ADDRESS = ", row[2])
   print("SALARY = ", row[3], "\n")

Total number of rows updated : 5
ID =  5
NAME =  Paul
ADDRESS =  California
SALARY =  20000.0

ID =  6
NAME =  Allen
ADDRESS =  Texas
SALARY =  2000.0

ID =  7
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0

ID =  8
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0

# DROP

In [10]:
# conn.close()
# conn = sqlite3.connect('database/aluar.db')
conn.execute("DROP TABLE COMPANY")
conn.commit()

In [21]:
conn.close()